================================================================================
empty
================================================================================

%

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
single line
================================================================================

% single comment

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
multiple start symbols
================================================================================

%%% multi "%"
hello

--------------------------------------------------------------------------------

(source_file
  (comment)
  (atom))

================================================================================
many consecutive lines
================================================================================

%% many
%% consecutive
hello
%% lines

--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (atom)
  (comment))

================================================================================
nested
================================================================================

[ 1 %% inside a list
, { 2 % and a tuple, too!
  , 3 }
]

--------------------------------------------------------------------------------

(source_file
  (expr_list
    (integer)
    (comment)
    (tuple
      (integer)
      (comment)
      (integer))))
