================================================================================
empty
================================================================================

%

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
single line
================================================================================

% single comment

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
multiple start symbols
================================================================================

%%% multi "%"
hello

--------------------------------------------------------------------------------

(source_file
  (comment)
  (expression
    (atom)))

================================================================================
many consecutive lines
================================================================================

%% many
%% consecutive
hello
%% lines

--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (expression
    (atom))
  (comment))

================================================================================
nested
================================================================================

[ 1 %% inside a list
, { 2 % and a tuple, too!
  , 3 }
]

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_list
      (expression
        (integer))
      (comment)
      (expression
        (tuple
          (expression
            (integer))
          (comment)
          (expression
            (integer)))))))
