===============================================================================
empty
===============================================================================

%

---

(source_file)

===============================================================================
single line
===============================================================================

% single comment

---

(source_file)

===============================================================================
multiple start symbols
===============================================================================

%%% multi "%"
hello

---

(source_file (expression (term (atom (unquoted_atom)))))

===============================================================================
many consecutive lines
===============================================================================

%% many
%% consecutive
hello
%% lines

---

(source_file (expression (term (atom (unquoted_atom)))))

===============================================================================
nested
===============================================================================

[ 1 %% inside a list
, { 2 % and a tuple, too!
  , 3 }
]

---

(source_file (expression (term (list (expression (term (integer))) (expression (term (tuple (expression (term (integer))) (expression (term (integer))))))))))
