================================================================================
apply lambda without args
================================================================================

Lambda()

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (computed_function_name
        (expression
          (variable))))))

================================================================================
apply lambda with args
================================================================================

Lambda(1)
Lambda(1,2,3)

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (computed_function_name
        (expression
          (variable)))
      (expression
        (term
          (integer)))))
  (expression
    (function_call
      (computed_function_name
        (expression
          (variable)))
      (expression
        (term
          (integer)))
      (expression
        (term
          (integer)))
      (expression
        (term
          (integer))))))

================================================================================
nested lambda application
================================================================================

Op(1, Lambda(1,2,3))

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (computed_function_name
        (expression
          (variable)))
      (expression
        (term
          (integer)))
      (expression
        (function_call
          (computed_function_name
            (expression
              (variable)))
          (expression
            (term
              (integer)))
          (expression
            (term
              (integer)))
          (expression
            (term
              (integer))))))))

================================================================================
qualified function call without args
================================================================================

local:function()

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (qualified_function_name
        (expression
          (term
            (atom
              (unquoted_atom))))
        (atom
          (unquoted_atom))))))

================================================================================
qualified function call with args
================================================================================

local:function(1)
local:function(1,2,3)

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (qualified_function_name
        (expression
          (term
            (atom
              (unquoted_atom))))
        (atom
          (unquoted_atom)))
      (expression
        (term
          (integer)))))
  (expression
    (function_call
      (qualified_function_name
        (expression
          (term
            (atom
              (unquoted_atom))))
        (atom
          (unquoted_atom)))
      (expression
        (term
          (integer)))
      (expression
        (term
          (integer)))
      (expression
        (term
          (integer))))))

================================================================================
nested qualified function calls
================================================================================

local:op(1, local:function(1,2,3))

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (qualified_function_name
        (expression
          (term
            (atom
              (unquoted_atom))))
        (atom
          (unquoted_atom)))
      (expression
        (term
          (integer)))
      (expression
        (function_call
          (qualified_function_name
            (expression
              (term
                (atom
                  (unquoted_atom))))
            (atom
              (unquoted_atom)))
          (expression
            (term
              (integer)))
          (expression
            (term
              (integer)))
          (expression
            (term
              (integer))))))))

================================================================================
local function call without args
================================================================================

local_function

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (atom
        (unquoted_atom)))))

================================================================================
local function call with args
================================================================================

local_function1

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (atom
        (unquoted_atom)))))

================================================================================
nested local function calls
================================================================================

local_op1

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (atom
        (unquoted_atom)))))

================================================================================
mixed function calls
================================================================================

module:function(Lambda(1, local_function(1,2,3)))

--------------------------------------------------------------------------------

(source_file
  (expression
    (function_call
      (qualified_function_name
        (expression
          (term
            (atom
              (unquoted_atom))))
        (atom
          (unquoted_atom)))
      (expression
        (function_call
          (computed_function_name
            (expression
              (variable)))
          (expression
            (term
              (integer)))
          (expression
            (function_call
              (computed_function_name
                (expression
                  (term
                    (atom
                      (unquoted_atom)))))
              (expression
                (term
                  (integer)))
              (expression
                (term
                  (integer)))
              (expression
                (term
                  (integer))))))))))
