================================================================================
named
================================================================================

A

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))

================================================================================
named with numbers
================================================================================

A1234

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))

================================================================================
class cased
================================================================================

AnotherVariable

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))

================================================================================
jiraffe cased
================================================================================

Another_variable

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))

================================================================================
ignored with name
================================================================================

_A

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))

================================================================================
ignored
================================================================================

_

--------------------------------------------------------------------------------

(source_file
  (expression
    (variable)))
