================================================================================
simple
================================================================================

case A of
 [] -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expr_case
    (variable)
    (case_clause
      (pattern
        (pat_list))
      (atom))))

================================================================================
multi branch
================================================================================

case f(A) of
 [] -> ok;
 _ -> error
end

--------------------------------------------------------------------------------

(source_file
  (expr_case
    (expr_function_call
      (computed_function_name
        (atom))
      (variable))
    (case_clause
      (pattern
        (pat_list))
      (atom))
    (case_clause
      (pattern
        (variable))
      (atom))))

================================================================================
multi branch ignoring
================================================================================

case Acc1 of
  none -> ok;
  _ -> Acc1
end

--------------------------------------------------------------------------------

(source_file
  (expr_case
    (variable)
    (case_clause
      (pattern
        (atom))
      (atom))
    (case_clause
      (pattern
        (variable))
      (variable))))

================================================================================
simple with guards
================================================================================

case A of
 [] when B -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expr_case
    (variable)
    (case_clause
      (pattern
        (pat_list))
      (guard_clause
        (guard_seq
          (guard
            (variable))))
      (atom))))

================================================================================
simple with multiple guards
================================================================================

case A of
 [] when B, C; D, E -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expr_case
    (variable)
    (case_clause
      (pattern
        (pat_list))
      (guard_clause
        (guard_seq
          (guard
            (variable)
            (variable))
          (guard
            (variable)
            (variable))))
      (atom))))
