================================================================================
simple
================================================================================

case A of
 [] -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expression
    (case
      (expression
        (variable))
      (case_clause
        (pattern
          (pat_list))
        (expression
          (atom))))))

================================================================================
multi branch
================================================================================

case f(A) of
 [] -> ok;
 _ -> error
end

--------------------------------------------------------------------------------

(source_file
  (expression
    (case
      (expression
        (function_call
          (computed_function_name
            (atom))
          (expression
            (variable))))
      (case_clause
        (pattern
          (pat_list))
        (expression
          (atom)))
      (case_clause
        (pattern
          (variable))
        (expression
          (atom))))))

================================================================================
multi branch ignoring
================================================================================

case Acc1 of
  none -> ok;
  _ -> Acc1
end

--------------------------------------------------------------------------------

(source_file
  (expression
    (case
      (expression
        (variable))
      (case_clause
        (pattern
          (atom))
        (expression
          (atom)))
      (case_clause
        (pattern
          (variable))
        (expression
          (variable))))))

================================================================================
simple with guards
================================================================================

case A of
 [] when B -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expression
    (case
      (expression
        (variable))
      (case_clause
        (pattern
          (pat_list))
        (guard_clause
          (guard_seq
            (guard
              (expression
                (variable)))))
        (expression
          (atom))))))

================================================================================
simple with multiple guards
================================================================================

case A of
 [] when B, C; D, E -> ok
end

--------------------------------------------------------------------------------

(source_file
  (expression
    (case
      (expression
        (variable))
      (case_clause
        (pattern
          (pat_list))
        (guard_clause
          (guard_seq
            (guard
              (expression
                (variable))
              (expression
                (variable)))
            (guard
              (expression
                (variable))
              (expression
                (variable)))))
        (expression
          (atom))))))
