================================================================================
single clause function
================================================================================

main() -> ok.

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (function_clause
      (atom)
      (lambda_clause
        (expression
          (atom))))))

================================================================================
single clause function with one arg
================================================================================

main(A) -> ok.

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (function_clause
      (atom)
      (lambda_clause
        (pattern
          (variable))
        (expression
          (atom))))))

================================================================================
single clause function with one ignored arg
================================================================================

main(_) -> ok.

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (function_clause
      (atom)
      (lambda_clause
        (pattern
          (variable))
        (expression
          (atom))))))

================================================================================
multi clause function
================================================================================

main([]) -> ok;
main(Args) -> ok.

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (function_clause
      (atom)
      (lambda_clause
        (pattern
          (pat_list))
        (expression
          (atom))))
    (function_clause
      (atom)
      (lambda_clause
        (pattern
          (variable))
        (expression
          (atom))))))
