================================================================================
simple
================================================================================

atom

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
simple with symbol
================================================================================

a_to_mic

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
simple with number
================================================================================

atom1

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
mixed case
================================================================================

anAtom

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
mixed case with number
================================================================================

anAtom9

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
quoted atom
================================================================================

'atom'

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
quoted atom with number
================================================================================

'atom'

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
quoted atom with symbols
================================================================================

'a.to!m"ic_0#%@^&*()}{[]'

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))

================================================================================
quoted atom with escapes
================================================================================

'abc\0\00\000\xAA\x{DEADBEEF}\n\r\t\v\b\f\e\s\d\
'

--------------------------------------------------------------------------------

(source_file
  (expression
    (atom)))
