================================================================================
empty
================================================================================

#r{}

--------------------------------------------------------------------------------

(source_file
  (expression
    (record
      (atom))))

================================================================================
record access
================================================================================

A#r.a

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_access
      (expression
        (variable))
      (atom)
      (atom))))

================================================================================
with one key and value
================================================================================

#r{ hello = world }

--------------------------------------------------------------------------------

(source_file
  (expression
    (record
      (atom)
      (record_field
        (atom)
        (expression
          (atom))))))

================================================================================
with many keys and values
================================================================================

#r{ hello = world
  , goodbye = moe
}

--------------------------------------------------------------------------------

(source_file
  (expression
    (record
      (atom)
      (record_field
        (atom)
        (expression
          (atom)))
      (record_field
        (atom)
        (expression
          (atom))))))

================================================================================
updates
================================================================================

M#r{ 1 = V }
(f())#r{ k = V }

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_update
      (expression
        (variable))
      (record
        (atom)
        (record_field
          (integer)
          (expression
            (variable))))))
  (expression
    (expr_record_update
      (expression
        (expr_function_call
          (computed_function_name
            (atom))))
      (record
        (atom)
        (record_field
          (atom)
          (expression
            (variable)))))))

================================================================================
nested record updates
================================================================================

N2#nrec2.nrec1#nrec1.nrec0#nrec0{name = "nested0a"}

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_update
      (expression
        (expr_record_access
          (expression
            (expr_record_access
              (expression
                (variable))
              (atom)
              (atom)))
          (atom)
          (atom)))
      (record
        (atom)
        (record_field
          (atom)
          (expression
            (string)))))))
