================================================================================
empty
================================================================================

{}

--------------------------------------------------------------------------------

(source_file
  (tuple))

================================================================================
tuple of size 1
================================================================================

{1}

--------------------------------------------------------------------------------

(source_file
  (tuple
    (integer)))

================================================================================
pair
================================================================================

{1, a}

--------------------------------------------------------------------------------

(source_file
  (tuple
    (integer)
    (atom)))

================================================================================
triplet
================================================================================

{1, a, <<"!">>}

--------------------------------------------------------------------------------

(source_file
  (tuple
    (integer)
    (atom)
    (binary_string
      (bin_part
        (string)))))

================================================================================
quad
================================================================================

{1, a, <<"!">>, $j}

--------------------------------------------------------------------------------

(source_file
  (tuple
    (integer)
    (atom)
    (binary_string
      (bin_part
        (string)))
    (char)))

================================================================================
nested tuples
================================================================================

{ok, {1, {}}}

--------------------------------------------------------------------------------

(source_file
  (tuple
    (atom)
    (tuple
      (integer)
      (tuple))))
