================================================================================
empty
================================================================================

#r{}

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (record
        (atom
          (unquoted_atom))))))

================================================================================
record access
================================================================================

A#r.a

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_access
      (expression
        (variable))
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom)))))

================================================================================
with one key and value
================================================================================

#r{ hello = world }

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (record
        (atom
          (unquoted_atom))
        (record_field
          (term
            (atom
              (unquoted_atom)))
          (expression
            (term
              (atom
                (unquoted_atom)))))))))

================================================================================
with many keys and values
================================================================================

#r{ hello = world
  , goodbye = moe
}

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (record
        (atom
          (unquoted_atom))
        (record_field
          (term
            (atom
              (unquoted_atom)))
          (expression
            (term
              (atom
                (unquoted_atom)))))
        (record_field
          (term
            (atom
              (unquoted_atom)))
          (expression
            (term
              (atom
                (unquoted_atom)))))))))

================================================================================
updates
================================================================================

M#r{ 1 = V }
(f())#r{ k = V }

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_update
      (expression
        (variable))
      (record
        (atom
          (unquoted_atom))
        (record_field
          (term
            (integer))
          (expression
            (variable))))))
  (expression
    (expr_record_update
      (expression
        (function_call
          (computed_function_name
            (atom
              (unquoted_atom)))))
      (record
        (atom
          (unquoted_atom))
        (record_field
          (term
            (atom
              (unquoted_atom)))
          (expression
            (variable)))))))

================================================================================
nested record updates
================================================================================

N2#nrec2.nrec1#nrec1.nrec0#nrec0{name = "nested0a"}

--------------------------------------------------------------------------------

(source_file
  (expression
    (expr_record_update
      (expression
        (expr_record_access
          (expression
            (expr_record_access
              (expression
                (variable))
              (atom
                (unquoted_atom))
              (atom
                (unquoted_atom))))
          (atom
            (unquoted_atom))
          (atom
            (unquoted_atom))))
      (record
        (atom
          (unquoted_atom))
        (record_field
          (term
            (atom
              (unquoted_atom)))
          (expression
            (term
              (string))))))))
