===============================================================================
empty
===============================================================================

[]

---

(source_file (expression (term (list))))

===============================================================================
list of size 1
===============================================================================

[1]

---

(source_file (expression (term (list (term (integer))))))

===============================================================================
pair
===============================================================================

[1, a]

---

(source_file (expression (term (list (term (integer)) (term (atom (unquoted_atom)))))))

===============================================================================
nested lists
===============================================================================

[ok, [1, []]]

---

(source_file (expression (term (list (term (atom (unquoted_atom))) (term (list (term (integer)) (term (list))))))))
