===============================================================================
empty
===============================================================================

<<>>

---

(source_file (term (binary_string)))

===============================================================================
with integer
===============================================================================

<<10>>

---

(source_file (term (binary_string (integer))))

===============================================================================
with integer and type-specifier
===============================================================================

<<10/integer>>

---

(source_file
 (term
  (binary_string
   (integer)
   (bin_type_list (bin_type)))))

===============================================================================
with integer and multiple type-specifier
===============================================================================

<<10/integer-signed-native>>

---

(source_file
 (term
  (binary_string
   (integer)
   (bin_type_list (bin_type) (bin_type) (bin_type)))))

===============================================================================
with integer and bit-pattern size
===============================================================================

<<10:2>>

---

(source_file
 (term
  (binary_string (integer) (bin_sized (integer)))))

===============================================================================
with integer and bit-pattern size and type-specifier
===============================================================================

<<10:2/little>>

---

(source_file
 (term
  (binary_string
    (integer)
    (bin_sized (integer))
    (bin_type_list (bin_type)))))

===============================================================================
with integer and bit-pattern size and multiple type-specifiers
===============================================================================

<<10:2/little-unsigned>>

---

(source_file
 (term
  (binary_string
    (integer)
    (bin_sized (integer))
    (bin_type_list (bin_type) (bin_type)))))

===============================================================================
with float
===============================================================================

<<10.10>>

---

(source_file (term (binary_string (float))))

===============================================================================
with float and type-specifier
===============================================================================

<<10.10/float>>

---

(source_file
 (term
  (binary_string
   (float)
   (bin_type_list (bin_type)))))

===============================================================================
with float and multiple type-specifier
===============================================================================

<<10.10/float-signed-native>>

---

(source_file
 (term
  (binary_string
   (float)
   (bin_type_list (bin_type) (bin_type) (bin_type)))))

===============================================================================
with float and bit-pattern size
===============================================================================

<<10.10:2>>

---

(source_file
 (term
  (binary_string (float) (bin_sized (integer)))))

===============================================================================
with float and bit-pattern size and type-specifier
===============================================================================

<<10.10:2/little>>

---

(source_file
 (term
  (binary_string
    (float)
    (bin_sized (integer))
    (bin_type_list (bin_type)))))

===============================================================================
with float and bit-pattern size and multiple type-specifiers
===============================================================================

<<10.10:2/little-unsigned>>

---

(source_file
 (term
  (binary_string
    (float)
    (bin_sized (integer))
    (bin_type_list (bin_type) (bin_type)))))

===============================================================================
with string
===============================================================================

<<"10">>

---

(source_file (term (binary_string (string))))
