===============================================================================
empty
===============================================================================

[]

---

(source_file (term (list)))

===============================================================================
list of size 1
===============================================================================

[1]

---

(source_file
 (term
  (list (term (integer)))))

===============================================================================
pair
===============================================================================

[1, a]

---

(source_file
 (term
  (list
   (term (integer))
   (term (atom (unquoted_atom))))))

===============================================================================
triplet
===============================================================================

[1, a, <<"!">>]

---

(source_file
 (term
  (list
   (term (integer))
   (term (atom (unquoted_atom)))
   (term (binary_string (bin_part (string)))))))

===============================================================================
quad
===============================================================================

[1, a, <<"!">>, $j]

---

(source_file
 (term
  (list
   (term (integer))
   (term (atom (unquoted_atom)))
   (term (binary_string (bin_part (string))))
   (term (char)))))

===============================================================================
nested lists
===============================================================================

[ok, [1, []]]

---

(source_file
 (term
  (list
   (term (atom (unquoted_atom)))
   (term (list (term (integer)) (term (list)))))))
