================================================================================
empty
================================================================================

[]

--------------------------------------------------------------------------------

(source_file
  (expr_list))

================================================================================
list of size 1
================================================================================

[1]

--------------------------------------------------------------------------------

(source_file
  (expr_list
    (integer)))

================================================================================
pair
================================================================================

[1, a]

--------------------------------------------------------------------------------

(source_file
  (expr_list
    (integer)
    (atom)))

================================================================================
nested lists
================================================================================

[ok, [1, []]]

--------------------------------------------------------------------------------

(source_file
  (expr_list
    (atom)
    (expr_list
      (integer)
      (expr_list))))

================================================================================
lists consing
================================================================================

[ok | [1 | []]]

--------------------------------------------------------------------------------

(source_file
  (expr_list
    (expr_list_cons
      (atom)
      (expr_list
        (expr_list_cons
          (integer)
          (expr_list))))))
