===============================================================================
empty
===============================================================================

{}

---

(source_file (expression (term (tuple))))

===============================================================================
tuple of size 1
===============================================================================

{1}

---

(source_file (expression (term (tuple (expression (term (integer)))))))

===============================================================================
pair
===============================================================================

{1, a}

---

(source_file (expression (term (tuple (expression (term (integer))) (expression (term (atom (unquoted_atom))))))))

===============================================================================
triplet
===============================================================================

{1, a, <<"!">>}

---

(source_file (expression (term (tuple (expression (term (integer))) (expression (term (atom (unquoted_atom)))) (expression (term (binary_string (bin_part (string)))))))))

===============================================================================
quad
===============================================================================

{1, a, <<"!">>, $j}

---

(source_file (expression (term (tuple (expression (term (integer))) (expression (term (atom (unquoted_atom)))) (expression (term (binary_string (bin_part (string))))) (expression (term (char)))))))

===============================================================================
nested tuples
===============================================================================

{ok, {1, {}}}

---

(source_file (expression (term (tuple (expression (term (atom (unquoted_atom)))) (expression (term (tuple (expression (term (integer))) (expression (term (tuple))))))))))
