================================================================================
empty
================================================================================

[]

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (list))))

================================================================================
list of size 1
================================================================================

[1]

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (list
        (expression
          (term
            (integer)))))))

================================================================================
pair
================================================================================

[1, a]

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (list
        (expression
          (term
            (integer)))
        (expression
          (term
            (atom
              (unquoted_atom))))))))

================================================================================
nested lists
================================================================================

[ok, [1, []]]

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (list
        (expression
          (term
            (atom
              (unquoted_atom))))
        (expression
          (term
            (list
              (expression
                (term
                  (integer)))
              (expression
                (term
                  (list))))))))))

================================================================================
lists consing
================================================================================

[ok | [1 | []]]

--------------------------------------------------------------------------------

(source_file
  (expression
    (term
      (list
        (expression
          (term
            (atom
              (unquoted_atom))))
        (expression
          (term
            (list
              (expression
                (term
                  (integer)))
              (expression
                (term
                  (list))))))))))
