===============================================================================
empty
===============================================================================

{}

---

(source_file (term (tuple)))

===============================================================================
tuple of size 1
===============================================================================

{1}

---

(source_file
 (term
  (tuple (term (integer)))))

===============================================================================
pair
===============================================================================

{1, a}

---

(source_file
 (term
  (tuple
   (term (integer))
   (term (atom (unquoted_atom))))))

===============================================================================
triplet
===============================================================================

{1, a, <<"!">>}

---

(source_file
 (term
  (tuple
   (term (integer))
   (term (atom (unquoted_atom)))
   (term (binary_string (bin_part (string)))))))

===============================================================================
quad
===============================================================================

{1, a, <<"!">>, $j}

---

(source_file
 (term
  (tuple
   (term (integer))
   (term (atom (unquoted_atom)))
   (term (binary_string (bin_part (string))))
   (term (char)))))

===============================================================================
nested tuples
===============================================================================

{ok, {1, {}}}

---

(source_file
 (term
  (tuple
   (term (atom (unquoted_atom)))
   (term (tuple (term (integer)) (term (tuple)))))))
